Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_comp.h
/** @defgroup COMP_Hysteresis COMP hysteresis
  * @{
  */
#define COMP_HYSTERESIS_DISABLE           (0x00000000UL)                       /*!< No hysteresis */
#define COMP_HYSTERESIS_ENABLE            (0x00000001UL)                       /*!< Hysteresis enable */  
/**
  * @}
  */

/** @defgroup COMP_TIM_EXTI_Out_Sel COMP TIM EXTI Output Selection
  * @{
  */
#define COMP_TIM_EXTI_OUT_NOFILTER                 (0x00000000UL)                      /*!< The comparator output to TIM or EXTI is no filtered */
#define COMP_TIM_EXTI_OUT_FILTER                   (COMP_CSR_TIM_EXTI_OUT_SEL)         /*!< The comparator output to TIM or EXTI is filtered */
/**
  * @} 
  */  

/** @defgroup COMP_OutputPolarity COMP output Polarity
  * @{
  */
#define COMP_OUTPUTPOL_NONINVERTED     (0x00000000UL)         /*!< COMP output level is not inverted (comparator output is high when the input plus is at a higher voltage than the input minus) */
#define COMP_OUTPUTPOL_INVERTED        (COMP_CSR_POLARITY)    /*!< COMP output level is inverted     (comparator output is low  when the input plus is at a higher voltage than the input minus) */
/**
  * @}
  */

/** @defgroup COMP_BlankingSrce  COMP blanking source
  * @{
  */
#define COMP_BLANKINGSRC_NONE             (0x00000000UL)          /*!<Comparator output without blanking */
#define COMP_BLANKINGSRC_TIM1_OC5_COMP1   (                                            COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP1). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM1_OC5_COMP2   (                                            COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP2). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM1_OC5_COMP3   (                                            COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP3). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM3_OC4_COMP4   (                                            COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM3 OC4 (specific to COMP instance: COMP4). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM2_OC3_COMP1   (                      COMP_CSR_BLANKSEL_1                      )   /*!< Comparator output blanking source TIM2 OC3 (specific to COMP instance: COMP1). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM2_OC3_COMP2   (                      COMP_CSR_BLANKSEL_1                      )   /*!< Comparator output blanking source TIM2 OC3 (specific to COMP instance: COMP2). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM3_OC3_COMP3   (                      COMP_CSR_BLANKSEL_1                      )   /*!< Comparator output blanking source TIM3 OC3 (specific to COMP instance: COMP3). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM8_OC5_COMP4   (                      COMP_CSR_BLANKSEL_1                      )   /*!< Comparator output blanking source TIM8 OC5 (specific to COMP instance: COMP4). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM3_OC3_COMP1   (                      COMP_CSR_BLANKSEL_1 | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM3 OC3 (specific to COMP instance: COMP1). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM3_OC3_COMP2   (                      COMP_CSR_BLANKSEL_1 | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM3 OC3 (specific to COMP instance: COMP2). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM2_OC4_COMP3   (                      COMP_CSR_BLANKSEL_1 | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM2 OC4 (specific to COMP instance: COMP3). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM15_OC2_COMP4  (                      COMP_CSR_BLANKSEL_1 | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM15 OC2 (specific to COMP instance: COMP4). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM8_OC5_COMP1   (COMP_CSR_BLANKSEL_2                                            )   /*!< Comparator output blanking source TIM8 OC5 (specific to COMP instance: COMP1). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM8_OC5_COMP2   (COMP_CSR_BLANKSEL_2                                            )   /*!< Comparator output blanking source TIM8 OC5 (specific to COMP instance: COMP2). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM8_OC5_COMP3   (COMP_CSR_BLANKSEL_2                                            )   /*!< Comparator output blanking source TIM8 OC5 (specific to COMP instance: COMP3). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM1_OC5_COMP4   (COMP_CSR_BLANKSEL_2                                            )   /*!< Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP4). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM18_OC3_COMP1  (COMP_CSR_BLANKSEL_2                       | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM18 OC3 (specific to COMP instance: COMP1). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM18_OC3_COMP2  (COMP_CSR_BLANKSEL_2                       | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM18 OC3 (specific to COMP instance: COMP2). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM18_OC4_COMP3  (COMP_CSR_BLANKSEL_2                       | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM18 OC4 (specific to COMP instance: COMP3). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM18_OC4_COMP4  (COMP_CSR_BLANKSEL_2                       | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM18 OC4 (specific to COMP instance: COMP4). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM15_OC1        (COMP_CSR_BLANKSEL_2 | COMP_CSR_BLANKSEL_1                      )   /*!< Comparator output blanking source TIM15 OC1 (specific to COMP instance: ALL). Note: For COMPx & TIMx instances availability, please refer to datasheet */
#define COMP_BLANKINGSRC_TIM4_OC3         (COMP_CSR_BLANKSEL_2 | COMP_CSR_BLANKSEL_1 | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM4 OC3 (specific to COMP instance: ALL). Note: For COMPx & TIMx instances availability, please refer to datasheet */
/**
  * @}
  */

