Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_comp.h
#define IS_COMP_HYSTERESIS(__HYSTERESIS__)  (((__HYSTERESIS__) == COMP_HYSTERESIS_DISABLE)   || \
                                             ((__HYSTERESIS__) == COMP_HYSTERESIS_ENABLE))

#ifdef COMP_VREFCMP_SOURCE_VREFINT0P6V
#define IS_COMP_VREFSRC(__VREFCMP__)         (((__VREFCMP__) == COMP_VREFCMP_SOURCE_VCC)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_SOURCE_VREFINT0P6V)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_SOURCE_VREFINT1P5V)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_SOURCE_VREFINT2P048V)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_SOURCE_VREFINT2P5V))    
#else
#define IS_COMP_VREFSRC(__VREFCMP__)         (((__VREFCMP__) == COMP_VREFCMP_SOURCE_VCC)   || \
                                              ((__VREFCMP__) == COMP_VREFCMP_SOURCE_VREFINT2P048V))
#endif

#define IS_COMP_VREFDIV(__VREFCMP__)         (((__VREFCMP__) == COMP_VREFCMP_DIV_DISABLE)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_1_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_2_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_3_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_4_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_5_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_6_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_7_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_8_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_9_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_10_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_11_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_12_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_13_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_14_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_15_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_16_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_17_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_18_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_19_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_20_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_21_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_22_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_23_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_24_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_25_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_26_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_27_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_28_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_29_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_30_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_31_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_32_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_33_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_34_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_35_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_36_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_37_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_38_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_39_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_40_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_41_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_42_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_43_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_44_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_45_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_46_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_47_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_48_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_49_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_50_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_51_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_52_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_53_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_54_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_55_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_56_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_57_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_58_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_59_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_60_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_61_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_62_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_63_64VREFCMP)   || \
                                             ((__VREFCMP__) == COMP_VREFCMP_DIV_VREFCMP))

#define IS_COMP_OUTPUTPOL(__POL__)          (((__POL__) == COMP_OUTPUTPOL_NONINVERTED) || \
                                             ((__POL__) == COMP_OUTPUTPOL_INVERTED))


#define IS_COMP_BLANKINGSRCE(__BLANKINGSRCE__)          (((__BLANKINGSRCE__) == COMP_BLANKINGSRC_NONE) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM1_OC5_COMP1) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM1_OC5_COMP2) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM1_OC5_COMP3) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM3_OC4_COMP4) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM2_OC3_COMP1) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM2_OC3_COMP2) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM3_OC3_COMP3) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM8_OC5_COMP4) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM3_OC3_COMP1) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM3_OC3_COMP2) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM2_OC4_COMP3) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM15_OC2_COMP4) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM8_OC5_COMP1) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM8_OC5_COMP2) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM8_OC5_COMP3) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM1_OC5_COMP4) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM18_OC3_COMP1) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM18_OC3_COMP2) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM18_OC4_COMP3) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM18_OC4_COMP4) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM15_OC1) || \
                                                         ((__BLANKINGSRCE__) == COMP_BLANKINGSRC_TIM4_OC3))

#define IS_COMP_TIMANDEXTIOUTSEL(__TIMANDEXTIOUTSEL__)          (((__TIMANDEXTIOUTSEL__) == COMP_TIM_EXTI_OUT_NOFILTER) || \
                                                                 ((__TIMANDEXTIOUTSEL__) == COMP_TIM_EXTI_OUT_FILTER))

#define IS_COMP_TRIGGERMODE(__MODE__)       (((__MODE__) == COMP_TRIGGERMODE_NONE)                 || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_RISING)            || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_FALLING)           || \
                                             ((__MODE__) == COMP_TRIGGERMODE_IT_RISING_FALLING)    || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING)         || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_FALLING)        || \
                                             ((__MODE__) == COMP_TRIGGERMODE_EVENT_RISING_FALLING))

#define IS_COMP_OUTPUT_LEVEL(__OUTPUT_LEVEL__) (((__OUTPUT_LEVEL__) == COMP_OUTPUT_LEVEL_LOW)     || \
                                                ((__OUTPUT_LEVEL__) == COMP_OUTPUT_LEVEL_HIGH))

/**
  * @}
  */

/**
  * @}
  */


/* Exported functions --------------------------------------------------------*/
/** @addtogroup COMP_Exported_Functions
  * @{
  */

/** @addtogroup COMP_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  **********************************/
HAL_StatusTypeDef HAL_COMP_Init(COMP_HandleTypeDef *hcomp);
HAL_StatusTypeDef HAL_COMP_DeInit(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_MspInit(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_MspDeInit(COMP_HandleTypeDef *hcomp);

#if (USE_HAL_COMP_REGISTER_CALLBACKS == 1)
/* Callbacks Register/UnRegister functions  ***********************************/
HAL_StatusTypeDef HAL_COMP_RegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID,
    pCOMP_CallbackTypeDef pCallback);
HAL_StatusTypeDef HAL_COMP_UnRegisterCallback(COMP_HandleTypeDef *hcomp, HAL_COMP_CallbackIDTypeDef CallbackID);
#endif /* USE_HAL_COMP_REGISTER_CALLBACKS */
/**
  * @}
  */

/* IO operation functions  *****************************************************/
/** @addtogroup COMP_Exported_Functions_Group2
  * @{
  */
HAL_StatusTypeDef HAL_COMP_Start(COMP_HandleTypeDef *hcomp);
HAL_StatusTypeDef HAL_COMP_Stop(COMP_HandleTypeDef *hcomp);
void              HAL_COMP_IRQHandler(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/* Peripheral Control functions  ************************************************/
/** @addtogroup COMP_Exported_Functions_Group3
  * @{
  */
HAL_StatusTypeDef HAL_COMP_Lock(COMP_HandleTypeDef *hcomp);
uint32_t          HAL_COMP_GetOutputLevel(COMP_HandleTypeDef *hcomp);
/* Callback in interrupt mode */
void              HAL_COMP_TriggerCallback(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/* Peripheral State functions  **************************************************/
/** @addtogroup COMP_Exported_Functions_Group4
  * @{
  */
HAL_COMP_StateTypeDef HAL_COMP_GetState(COMP_HandleTypeDef *hcomp);
uint32_t              HAL_COMP_GetError(COMP_HandleTypeDef *hcomp);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32E407_HAL_COMP_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
